cf/InformationRegisters/нсиНастройкиБПДляСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>нсиНастройкиБПДляСправочников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтборПредметов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиНастройкиПоискаДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиНастройкиБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/нсиНастройкиБПДляСправочников/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	нсиБизнесПроцессы.ЗаполнитьСписокСправочниковВедущихсяПоЗаявкам(Элементы.ИмяСправочника.СписокВыбора);
	УправлениеВидимостьюИДоступом();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Использовать Тогда 
		Если ТекущийОбъект.Заявитель = Справочники.ГруппыПользователей.ВсеПользователи Тогда 
			Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	1 КАК Поле1
				|ИЗ
				|	РегистрСведений.нсиНастройкиБПДляСправочников КАК нсиНастройкиБПДляСправочников
				|ГДЕ
				|	нсиНастройкиБПДляСправочников.ИмяСправочника = &ИмяСправочника
				|	И нсиНастройкиБПДляСправочников.НастройкаБП.ИмяБП = &ИмяБП
				|	И нсиНастройкиБПДляСправочников.Использовать
				|	И нсиНастройкиБПДляСправочников.Заявитель В (
				|		НЕОПРЕДЕЛЕНО,
				|		ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
				|		ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка),
				|		ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
				|	)
				|"
			);
			Запрос.УстановитьПараметр("ИмяБП",ТекущийОбъект.НастройкаБП.ИмяБП);
			Запрос.УстановитьПараметр("ИмяСправочника",ТекущийОбъект.ИмяСправочника);
			Запрос.УстановитьПараметр("Заявитель",ТекущийОбъект.Заявитель);
			Если Запрос.Выполнить().Выбрать().Количество()>1 Тогда 
				ТекстСообщения = 
					"Для справочника """+ТекущийОбъект.ИмяСправочника
					+""" и бизнес-процесса """+ТекущийОбъект.НастройкаБП.ИмяБП
					+""" уже есть используемая настройка по умолчанию.";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаБППриИзменении(Элемент)
	УправлениеВидимостьюИДоступом();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюИДоступом()
	Элементы.ОтборПредметов.Видимость = Запись.НастройкаБП.ИмяБП <> "нсиПакетныйВводЭлементовСправочника";
КонецПроцедуры

#КонецОбласти
